# setup shell and core tools first
brew "git"
brew "git-lfs"
brew "wget"
brew "zsh"
brew "node"

# everything else
brew "ack"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "diff-so-fancy"
brew "jq"
brew "lf"
brew "rcm"
brew "rg"
brew "starship"
brew "tealdeer"
brew "trash"
brew "tree"
brew "universal-ctags"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

tap "jesseduffield/lazygit"
brew "lazygit"

tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"

cask "1password"
cask "1password-cli"
cask "bartender"
cask "brave-browser"
cask "dash"
cask "discord"
cask "karabiner-elements"
cask "keybase"
cask "little-snitch"
cask "notion"
cask "obsidian"
cask "rapidapi"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "spacelauncher"
cask "tableplus"
cask "trailer"
cask "tuple"
cask "visual-studio-code"
cask "zoom"

brew "ssh-copy-id"

tap "koekeishiya/formulae"
brew "skhd"
brew "yabai"

tap "homebrew/autoupdate"

brew "mas"

mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "Dynamic Wallpaper", id: 1453504509
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
